balmerdx/KendryteK210_base_project/Maixduino_esp32/main/CommandHandler.cpp
int getCurrSSID(const uint8_t command[], uint8_t response[])
{
  // ssid
  const char* ssid = WiFi.SSID();
  uint8_t ssidLen = strlen(ssid);

  response[2] = 1; // number of parameters
  response[3] = ssidLen; // parameter 1 length

  memcpy(&response[4], ssid, ssidLen);

  return (5 + ssidLen);
}

int getCurrBSSID(const uint8_t command[], uint8_t response[])
{
  uint8_t bssid[6];

  WiFi.BSSID(bssid);

  response[2] = 1; // number of parameters
  response[3] = 6; // parameter 1 length

  memcpy(&response[4], bssid, sizeof(bssid));

  return 11;
}

int getCurrRSSI(const uint8_t command[], uint8_t response[])
{
  int32_t rssi = WiFi.RSSI();

  response[2] = 1; // number of parameters
  response[3] = sizeof(rssi); // parameter 1 length

  memcpy(&response[4], &rssi, sizeof(rssi));

  return 9;
}

int getCurrEnct(const uint8_t command[], uint8_t response[])
{
  uint8_t encryptionType = WiFi.encryptionType();

  response[2] = 1; // number of parameters
  response[3] = 1; // parameter 1 length
  response[4] = encryptionType;

  return 6;
}

static int8_t numNetworks = 0;
int scanNetworks(const uint8_t command[], uint8_t response[])
{
  numNetworks = WiFi.scanNetworks();

  response[0] = CESP_SCAN_NETWORKS;
  response[1] = numNetworks;
  response[2] = 0;
  response[3] = 0;

  return CESP_RESP_SCAN_NETWORKS;
}

int scanNetworksResult(const uint8_t command[], uint8_t response[])
{
  int responseLength = 0;
  response[responseLength++] = numNetworks;

  for (int i = 0; i < numNetworks; i++) {
    response[responseLength++] = WiFi.RSSI(i);
    response[responseLength++] = WiFi.encryptionType(i);

    const char* ssid = WiFi.SSID(i);
    int ssidMaxLen = 33;
    memcpy(&response[responseLength], ssid, ssidMaxLen);
    responseLength += ssidMaxLen;
  }

  return responseLength;
}


int startServerTcp(const uint8_t command[], uint8_t response[])
{
  uint32_t ip = 0;
  uint16_t port;
  uint8_t socket;
  uint8_t type;

  if (command[2] == 3) {
    memcpy(&port, &command[4], sizeof(port));
    port = ntohs(port);
    socket = command[7];
    type = command[9];
  } else {
    memcpy(&ip, &command[4], sizeof(ip));
    memcpy(&port, &command[9], sizeof(port));
    port = ntohs(port);
    socket = command[12];
    type = command[14];
  }

  response[2] = 1; // number of parameters
  response[3] = 1; // parameter 1 length

  if (type == 0x00) {
    tcpServers[socket] = WiFiServer(port);

    tcpServers[socket].begin();

    socketTypes[socket] = 0x00;
    response[4] = 1;
  } else if (type == 0x01 && udps[socket].begin(port)) {
    socketTypes[socket] = 0x01;
    response[4] = 1;
  } else if (type == 0x03 && udps[socket].beginMulticast(ip, port)) {
    socketTypes[socket] = 0x01;
    response[4] = 1;
  } else {
    response[4] = 0;
  }

  return 6;
}

int getStateTcp(const uint8_t command[], uint8_t response[])
{
  uint8_t socket = command[4];

  response[2] = 1; // number of parameters
  response[3] = 1; // parameter 1 length

  if (tcpServers[socket]) {
    response[4] = 1;
  } else {
    response[4] = 0;
  }

  return 6;
}

int availSocketData(const uint8_t command[], uint8_t response[])
{
  uint8_t socket = command[1];
  uint16_t available = 0;

  if (socketTypes[socket] == 0x00) {
    if (tcpServers[socket]) {
      WiFiClient client = tcpServers[socket].available();

      available = 255;

      if (client) {
        // try to find existing socket slot
        for (int i = 0; i < MAX_SOCKETS; i++) {
          if (i == socket) {
            continue; // skip this slot
          }

          if (socketTypes[i] == 0x00 && tcpClients[i] == client) {
            available = i;
            break;
          }
        }

        if (available == 255) {
          // book keep new slot

          for (int i = 0; i < MAX_SOCKETS; i++) {
            if (i == socket) {
              continue; // skip this slot
            }

            if (socketTypes[i] == 255) {
              socketTypes[i] = 0x00;
              tcpClients[i] = client;

              available = i;
              break;
            }
          }
        }
      }
    } else {
      available = tcpClients[socket].available();
    }
  } else if (socketTypes[socket] == 0x01) {
    available = udps[socket].available();

    if (available <= 0) {
      available = udps[socket].parsePacket();
    }
  } else if (socketTypes[socket] == 0x02) {
    available = tlsClients[socket].available();
  }

  *(uint32_t*)response = available;

  return CESP_RESP_AVAIL_SOCKET_DATA;
}

int getDataTcp(const uint8_t command[], uint8_t response[])
{
  uint8_t socket = command[4];
  uint8_t peek = command[6];

  response[2] = 1; // number of parameters
  response[3] = 1; // parameter 1 length

  if (socketTypes[socket] == 0x00) {
    if (peek) {
      response[4] = tcpClients[socket].peek();
    } else {
      response[4] = tcpClients[socket].read();
    }
  } else if (socketTypes[socket] == 0x01) {
    if (peek) {
      response[4] = udps[socket].peek();
    } else {
      response[4] = udps[socket].read();
    }
  } else if (socketTypes[socket] == 0x02) {
    if (peek) {
      response[4] = tlsClients[socket].peek();
    } else {
      response[4] = tlsClients[socket].read();
    }
  }

  return 6;
}

int startSocketClient(const uint8_t command[], uint8_t response[])
{
  const char* host = NULL;
  uint32_t ip;
  uint16_t port;
  uint8_t socket;
  uint8_t type;

  memcpy(&port, command+2, sizeof(port));
  socket = command[4];
  type = command[5];

  printf("startSocketClient type=%i port=%u\n", (int)type, (int)port);
  if (command[1] == 0) {
    memcpy(&ip, command+8, sizeof(ip));
    printf("ip=%u.%u.%u.%u\n", ip&0xFF, (ip>>8)&0xFF, (ip>>16)&0xFF, (ip>>24)&0xFF);
  } else {
    host = (const char*)(command+8);
  }
  int result = 0;
  if (type == 0x00) {//TCP mode
    if (host) {
      result = tcpClients[socket].connect(host, port);
    } else {
      result = tcpClients[socket].connect(ip, port);
    }

    if (result)
      socketTypes[socket] = 0x00;
  } else if (type == 0x01) {//UDP Mode
    result = udps[socket].begin();
    if(result){
      if (host) {
        result = udps[socket].beginPacket(host, port);
      } else {
        result = udps[socket].beginPacket(ip, port);
      }
    }

    if (result)
      socketTypes[socket] = 0x01;
  } else if (type == 0x02) {//TLS Mode
    if (host) {
      if (setCert && setPSK) {
        tlsClients[socket].setCertificate(CERT_BUF);
        tlsClients[socket].setPrivateKey(PK_BUFF);
      }
      result = tlsClients[socket].connect(host, port);
    } else {
      if (setCert && setPSK) {
        tlsClients[socket].setCertificate(CERT_BUF);
        tlsClients[socket].setPrivateKey(PK_BUFF);
      }
      result = tlsClients[socket].connect(ip, port);
    }

    if (result) {
      socketTypes[socket] = 0x02;
    }
  }

  *(uint32_t*)response = result?1:0;
  return CESP_RESP_START_SOCKET_CLIENT;
}

int closeSocket(const uint8_t command[], uint8_t response[])
{
  uint8_t socket = command[1];

  if (socketTypes[socket] == 0x00) {
    tcpClients[socket].stop();

    socketTypes[socket] = 255;
  } else if (socketTypes[socket] == 0x01) {
    udps[socket].stop();

    socketTypes[socket] = 255;
  } else if (socketTypes[socket] == 0x02) {
    tlsClients[socket].stop();

    socketTypes[socket] = 255;
  }

  *(uint32_t*)response = 0;
  return CESP_RESP_CLOSE_SOCKET;
}

int getSocketState(const uint8_t command[], uint8_t response[])
{
  uint8_t socket = command[1];

  uint8_t connected = 0;

