balmerdx/KendryteK210_base_project/Maixduino_esp32/main/CommandHandler.cpp
  if ((socketTypes[socket] == 0x00) && tcpClients[socket].connected()) {
    connected = 1;
  } else if ((socketTypes[socket] == 0x02) && tlsClients[socket].connected()) {
    connected = 1;
  }

  *(uint32_t*)response = connected;

  return CESP_RESP_GET_SOCKET_STATE;
}

int disconnect(const uint8_t command[], uint8_t response[])
{
  response[2] = 1; // number of parameters
  response[3] = 1; // parameter 1 length
  response[4] = 1;

  WiFi.disconnect();

  return 6;
}

int getIdxRSSI(const uint8_t command[], uint8_t response[])
{
  // RSSI
  int32_t rssi = WiFi.RSSI(command[4]);

  response[2] = 1; // number of parameters
  response[3] = sizeof(rssi); // parameter 1 length

  memcpy(&response[4], &rssi, sizeof(rssi));

  return 9;
}

int getIdxEnct(const uint8_t command[], uint8_t response[])
{
  uint8_t encryptionType = WiFi.encryptionType(command[4]);

  response[2] = 1; // number of parameters
  response[3] = 1; // parameter 1 length
  response[4] = encryptionType;

  return 6;
}

int reqHostByName(const uint8_t command[], uint8_t response[])
{
  uint32_t* resp32 = (uint32_t*)response;
  const char* host = (const char*)(command+1);
  uint32_t resolvedHostname = /*IPAddress(255, 255, 255, 255)*/0xffffffff;
  resp32[0] = WiFi.hostByName(host, resolvedHostname)?1:0;
  resp32[1] = resolvedHostname;
  return CESP_RESP_REQ_HOST_BY_NAME;
}

int getFwVersion(const uint8_t command[], uint8_t response[])
{
  memset(response, 0, CESP_RESP_FW_VERSION);
  memcpy(response, FIRMWARE_VERSION, sizeof(FIRMWARE_VERSION));
  return CESP_RESP_FW_VERSION;
}

int sendUDPdata(const uint8_t command[], uint8_t response[])
{
  uint8_t socket = command[4];

  response[2] = 1; // number of parameters
  response[3] = 1; // parameter 1 length

  if (udps[socket].endPacket()) {
    response[4] = 1;
  } else {
    response[4] = 0;
  }

  return 6;
}

int getRemoteData(const uint8_t command[], uint8_t response[])
{
  uint8_t socket = command[4];
  
  /*IPAddress*/uint32_t ip = /*IPAddress(0, 0, 0, 0)*/0;
  uint16_t port = 0;

  if (socketTypes[socket] == 0x00) {
    ip = tcpClients[socket].remoteIP();
    port = tcpClients[socket].remotePort();
  } else if (socketTypes[socket] == 0x01) {
    ip = udps[socket].remoteIP();
    port = udps[socket].remotePort();
  } else if (socketTypes[socket] == 0x02) {
    ip = tlsClients[socket].remoteIP();
    port = tlsClients[socket].remotePort();
  }

  response[2] = 2; // number of parameters

  response[3] = 4; // parameter 1 length
  memcpy(&response[4], &ip, sizeof(ip));

  response[8] = 2; // parameter 2 length
  response[9] = (port >> 8) & 0xff;
  response[10] = (port >> 0) & 0xff;

  return 12;
}

int getTime(const uint8_t command[], uint8_t response[])
{
  unsigned long now = WiFi.getTime();

  response[2] = 1; // number of parameters
  response[3] = sizeof(now); // parameter 1 length

  memcpy(&response[4], &now, sizeof(now));

  return 5 + sizeof(now);
}

int getIdxBSSID(const uint8_t command[], uint8_t response[])
{
  uint8_t bssid[6];

  WiFi.BSSID(command[4], bssid);

  response[2] = 1; // number of parameters
  response[3] = 6; // parameter 1 length
  memcpy(&response[4], bssid, sizeof(bssid));

  return 11;
}

int getIdxChannel(const uint8_t command[], uint8_t response[])
{
  uint8_t channel = WiFi.channel(command[4]);

  response[2] = 1; // number of parameters
  response[3] = 1; // parameter 1 length
  response[4] = channel;

  return 6;
}

int sendSocketData(const uint8_t command[], uint8_t response[])
{
  uint8_t socket;
  uint16_t length;
  uint16_t written = 0;

  socket = command[1];
  memcpy(&length, command+2, sizeof(length));
  const uint8_t* data = command+4;

  if ((socketTypes[socket] == 0x00) && tcpServers[socket]) {
    written = tcpServers[socket].write(data, length);
  } else if (socketTypes[socket] == 0x00) {
    written = tcpClients[socket].write(data, length);
  } else if (socketTypes[socket] == 0x02) {
    written = tlsClients[socket].write(data, length);
  }
  printf("sendSocketData socket=%i length=%i written=%i\n", (int)socket, (int)length, (int)written);
  *(uint32_t*)response = written;
  return CESP_RESP_SEND_SOCKET_DATA;
}

int readSocketData(const uint8_t command[], uint8_t response[])
{
  uint8_t socket;
  uint16_t length;
  int read = 0;

  socket = command[1];
  memcpy(&length, &command[2], sizeof(length));
  uint8_t* out = response + 4;

  if(length > SPI_BUFFER_LEN-4) {
    //no read data
  } else if (socketTypes[socket] == 0x00) {
    read = tcpClients[socket].read(out, length);
  } else if (socketTypes[socket] == 0x01) {
    read = udps[socket].read(out, length);
  } else if (socketTypes[socket] == 0x02) {
    read = tlsClients[socket].read(out, length);
  }

  if (read < 0)
    read = 0;

  *(uint32_t*)response = read;

  return (4 + read);
}

int insertDataBuf(const uint8_t command[], uint8_t response[])
{
  uint8_t socket;
  uint16_t length;

  socket = command[5];
  memcpy(&length, &command[6], sizeof(length));
  length = ntohs(length);

  response[2] = 1; // number of parameters
  response[3] = 1; // parameter 1 length

  if (udps[socket].write(&command[8], length) != 0) {
    response[4] = 1;
  } else {
    response[4] = 0;
  }

  return 6;
}

int ping(const uint8_t command[], uint8_t response[])
{
  uint32_t ip;
  uint8_t ttl;
  int16_t result;

  ttl = command[1];
  memcpy(&ip, &command[4], sizeof(ip));

  result = WiFi.ping(ip, ttl);

  response[0] = CESP_PING;
  response[1] = 0;
  memcpy(&response[2], &result, sizeof(result));

  return CESP_RESP_PING;
}

int getSocket(const uint8_t command[], uint8_t response[])
{
  uint8_t result = 255;

  for (int i = 0; i < MAX_SOCKETS; i++) {
    if (socketTypes[i] == 255) {
      result = i;
      break;
    }
  }

  *(uint32_t*)response = result;
  return CESP_RESP_GET_SOCKET;
}

int setPinMode(const uint8_t command[], uint8_t response[])
{
  uint8_t pin = command[4];
  uint8_t mode = command[6];

  pinMode(pin, mode);

  response[2] = 1; // number of parameters
  response[3] = 1; // parameter 1 length
  response[4] = 1;

  return 6;
}

int setDigitalWrite(const uint8_t command[], uint8_t response[])
{
  uint8_t pin = command[4];
  uint8_t value = command[6];

  digitalWrite(pin, value);

  response[2] = 1; // number of parameters
  response[3] = 1; // parameter 1 length
  response[4] = 1;

  return 6;
}

int setAnalogWrite(const uint8_t command[], uint8_t response[])
{
  uint8_t pin = command[4];
  uint8_t value = command[6];

  analogWrite(pin, value);

  response[2] = 1; // number of parameters
  response[3] = 1; // parameter 1 length
  response[4] = 1;

  return 6;
}

int wpa2EntSetIdentity(const uint8_t command[], uint8_t response[]) {
  char identity[32 + 1];

  memset(identity, 0x00, sizeof(identity));
  memcpy(identity, &command[4], command[3]);

  esp_wifi_sta_wpa2_ent_set_identity((uint8_t *)identity, strlen(identity));

  response[2] = 1; // number of parameters
  response[3] = 1; // parameter 1 length
  response[4] = 1;

  return 6;
}

int wpa2EntSetUsername(const uint8_t command[], uint8_t response[]) {
  char username[32 + 1];

